# InstanceScheduleOnlyLevelParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..InstanceScheduleOnlyLevelParam Property
ParameterTypeId Class See Also
---
"Schedule Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId InstanceScheduleOnlyLevelParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InstanceScheduleOnlyLevelParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InstanceScheduleOnlyLevelParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace